---

In [1]:
import pandas as pd

In [2]:
weight = pd.read_csv('../data/weight_loss.csv',encoding='cp949')

In [3]:
weight.head()

   이름   월   주  몸무게
0  지완  1월  1주   70
1  찬준  1월  1주   60
2  지완  1월  2주   69
3  찬준  1월  2주   59
4  지완  1월  3주   69

## 문제1: 
### 위 데이터프레임을 바탕으로 이름을 행으로 월을 열로 
###      몸무게 값의 평균을 값으로하는 데이터프레임을 구성해보자

In [4]:
weight2 = weight.pivot_table(values = '몸무게',index = '이름',columns = '월', aggfunc='mean')

In [5]:
weight2

월      1월    2월     3월     4월
이름
지완  69.25  67.5  65.25  62.75
찬준  59.25  57.5  55.25  52.75

---

## 문제2: weight2 데이터프레임의 행과 열 위치를 바꾸어보자

In [6]:
weight2_un = weight2.unstack()

In [7]:
weight2_un

월   이름
1월  지완    69.25
    찬준    59.25
2월  지완    67.50
    찬준    57.50
3월  지완    65.25
    찬준    55.25
4월  지완    62.75
    찬준    52.75
dtype: float64

In [8]:
weight2_un.to_frame()

           0
월  이름
1월 지완  69.25
   찬준  59.25
2월 지완  67.50
   찬준  57.50
3월 지완  65.25
   찬준  55.25
4월 지완  62.75
   찬준  52.75

In [9]:
weight2_un.unstack()

이름     지완     찬준
월
1월  69.25  59.25
2월  67.50  57.50
3월  65.25  55.25
4월  62.75  52.75

#### 답1

In [10]:
weight_st = weight2.stack()

In [11]:
weight_st

이름  월
지완  1월    69.25
    2월    67.50
    3월    65.25
    4월    62.75
찬준  1월    59.25
    2월    57.50
    3월    55.25
    4월    52.75
dtype: float64

#### 답 2

In [12]:
weight3 = weight_st.to_frame()

In [13]:
weight3

           0
이름 월
지완 1월  69.25
   2월  67.50
   3월  65.25
   4월  62.75
찬준 1월  59.25
   2월  57.50
   3월  55.25
   4월  52.75

In [14]:
weight3.unstack(0)

        0
이름     지완     찬준
월
1월  69.25  59.25
2월  67.50  57.50
3월  65.25  55.25
4월  62.75  52.75

#### 답2 보완점: 자동으로 생성된 상위 열 이름(0)이 남아있다.

---

In [15]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천","부산"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010","2015"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 2632003,1000000],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권","경상권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632003  수도권
8  부산  2015  1000000  경상권

## 문제3: 
### 지역을 기준으로 피벗테이블을 만들어보고  
### 그룹바이함수를 통해서도 만들어보자

#### 답1

In [16]:
df2 = df1.pivot_table('인구','지역','연도', aggfunc = 'sum')
df2

연도      2005      2010      2015
지역
경상권  3512547   3393191   4448737
수도권  9762546  12263485  12794763

#### 답2

In [17]:
df2.groupby('지역').sum()

연도      2005      2010      2015
지역
경상권  3512547   3393191   4448737
수도권  9762546  12263485  12794763

---

In [18]:
data2 = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천","부산"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010","2015"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 2632003,1000000],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권","경상권"]
}
columns = ["도시", "연도", "인구", "지역"]
df3 = pd.DataFrame(data2, columns=columns)

In [19]:
df4=df3.pivot_table(values='인구', index='도시', columns='연도', aggfunc='sum')
df4

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  4448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632003.0  2890451.0

## 문제4(복습): 인천의 2005년 결측치를 합리적인 방법으로 채워보자

In [20]:
incheon_2005 = df4['2005']['인천']
incheon_2005

nan

In [21]:
incheon_2010 = df4['2010']['인천']
incheon_2010

2632003.0

In [22]:
incheon_2015 = df4['2015']['인천']
incheon_2015

2890451.0

In [23]:
diff = incheon_2010 - (incheon_2015 - incheon_2010)

In [24]:
df4['2005']['인천'] = diff

In [25]:
df4

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  4448737.0
서울  9762546.0  9631482.0  9904312.0
인천  2373555.0  2632003.0  2890451.0

---

In [26]:
import numpy as np

In [27]:
import seaborn as sns
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## 문제5:
##    tip의 가격에 영향을 미친 요인으로 sex,smoker,day,time을 선정했을 때,
##    각 요인의 비중이 더 큰요인을 나타내는 데이터프레임을 구성해보자

#### 답:

In [28]:
df_sex = df.groupby('sex').mean()
df_sex

        total_bill       tip      size
sex
Male     20.744076  3.089618  2.630573
Female   18.056897  2.833448  2.459770

In [29]:
df_sex_index = df_sex['tip'].nlargest(1).index.values
df_sex_index

['Male']
Categories (2, object): ['Male', 'Female']

In [30]:
df_smoker = df.groupby('smoker').mean()
df_smoker

        total_bill       tip      size
smoker
Yes      20.756344  3.008710  2.408602
No       19.188278  2.991854  2.668874

In [31]:
df_smoker_index = df_smoker['tip'].nlargest(1).index.values
df_smoker_index

['Yes']
Categories (2, object): ['Yes', 'No']

In [32]:
df_day = df.groupby('day').mean()
df_day

      total_bill       tip      size
day
Thur   17.682742  2.771452  2.451613
Fri    17.151579  2.734737  2.105263
Sat    20.441379  2.993103  2.517241
Sun    21.410000  3.255132  2.842105

In [33]:
df_day_index = df_day['tip'].nlargest(1).index.values
df_day_index

['Sun']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [34]:
df_time = df.groupby('time').mean()
df_time

        total_bill       tip      size
time
Lunch    17.168676  2.728088  2.411765
Dinner   20.797159  3.102670  2.630682

In [35]:
df_time_index = df_time['tip'].nlargest(1).index.values
df_time_index

['Dinner']
Categories (2, object): ['Lunch', 'Dinner']

In [36]:
sex_index = df_sex_index.astype(np.object)
sex_index

C:\Users\tj\AppData\Local\Temp\ipykernel_12352\683114584.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  sex_index = df_sex_index.astype(np.object)

array(['Male'], dtype=object)

In [37]:
smoker_index = df_smoker_index.astype(np.object)
smoker_index

C:\Users\tj\AppData\Local\Temp\ipykernel_12352\3295270402.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  smoker_index = df_smoker_index.astype(np.object)

array(['Yes'], dtype=object)

In [38]:
day_index = df_day_index.astype(np.object)
day_index

C:\Users\tj\AppData\Local\Temp\ipykernel_12352\4061752470.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  day_index = df_day_index.astype(np.object)

array(['Sun'], dtype=object)

In [39]:
time_index = df_time_index.astype(np.object)
time_index

C:\Users\tj\AppData\Local\Temp\ipykernel_12352\816711128.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  time_index = df_time_index.astype(np.object)

array(['Dinner'], dtype=object)

In [40]:
data22 = [sex_index,smoker_index,day_index,time_index]

In [41]:
data22

[array(['Male'], dtype=object),
 array(['Yes'], dtype=object),
 array(['Sun'], dtype=object),
 array(['Dinner'], dtype=object)]

In [42]:
df22 = pd.DataFrame(data22,
                   index = ['sex','smoker','day','time'],
                   columns = ['most_factor'])

In [43]:
df22

       most_factor
sex           Male
smoker         Yes
day            Sun
time        Dinner

#### 답의 보완점: warnning 메시지 회피 방법, 어레이 형식을 풀고 오브젝트로 데이터를 구성해보자

---

In [44]:
get_ipython().system('pip install chardet')

Requirement already satisfied: chardet in c:\users\tj\anaconda3\lib\site-packages (4.0.0)

In [45]:
import chardet

In [46]:

def find_encoding(fname):
    r_file = open(fname,'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [47]:
my_encoding1 = find_encoding('../data/musicData.csv')
my_encoding1

'UTF-8-SIG'

In [48]:
jdf = pd.read_csv('../data/musicData.csv', encoding = my_encoding1)

In [49]:
jdf.head()

,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count
0,거기가 어딘데?? OST,Various Artists,O.S.T,2018.09.01,워너뮤직코리아,6.4,8
1,얍,갈릭스(Garlixx),"인디뮤직, 락",2018.09.01,(주)미러볼뮤직,3.8,2
2,너와 나,파란,발라드,2018.09.01,(주)지니뮤직,7.7,2
3,PRODUCE 48 - FINAL,PRODUCE 48,댄스,2018.09.01,Stone Music Entertainment,7.0,4
4,Weather : 오늘 당신의 날씨는 어떤가요? Part 4,이진아,재즈,2018.09.01,(주)지니뮤직,6.7,1

In [50]:
jdf2 = pd.read_csv('../data/musicData2.csv', encoding = my_encoding1)

In [51]:
jdf2.head()

,Year,Month,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count
0,2017,1,Boys and Girls Music Vol. 1,샘김,알앤비/어반,2017.01.25,로엔 엔터테인먼트,8.6,2
1,2017,1,여자친구 The 1st Album 'LOL',여자친구(GFRIEND),댄스,2016.07.11,로엔엔터테인먼트,8.1,12
2,2017,1,Collage (EP),The Chainsmokers,일렉트로니카,2016.11.05,소니뮤직,7.5,5
3,2017,1,If You,에일리,발라드,2016.08.23,로엔 엔터테인먼트,6.9,1
4,2017,1,세 단어,젝스키스,발라드,2016.10.07,YG PLUS,9.0,1

## 문제6 : 두 데이터 프레임에서 공통되는 열만 합쳐 하나의 데이터 프레임으로 만드세요

In [52]:
jdf2_copy = jdf2.copy()

In [53]:
jdf2_copy = jdf2_copy.sort_index(axis = 1)

In [54]:
jdf2_copy.head()

,Album Title,Artist Name,Date,Distribution,Genre,Month,Music Count,Rating,Year
0,Boys and Girls Music Vol. 1,샘김,2017.01.25,로엔 엔터테인먼트,알앤비/어반,1,2,8.6,2017
1,여자친구 The 1st Album 'LOL',여자친구(GFRIEND),2016.07.11,로엔엔터테인먼트,댄스,1,12,8.1,2017
2,Collage (EP),The Chainsmokers,2016.11.05,소니뮤직,일렉트로니카,1,5,7.5,2017
3,If You,에일리,2016.08.23,로엔 엔터테인먼트,발라드,1,1,6.9,2017
4,세 단어,젝스키스,2016.10.07,YG PLUS,발라드,1,1,9.0,2017

In [55]:
jdf2_cut1 = jdf2_copy.loc[:,'Album Title':'Genre']

In [56]:
jdf2_cut1.head()

,Album Title,Artist Name,Date,Distribution,Genre
0,Boys and Girls Music Vol. 1,샘김,2017.01.25,로엔 엔터테인먼트,알앤비/어반
1,여자친구 The 1st Album 'LOL',여자친구(GFRIEND),2016.07.11,로엔엔터테인먼트,댄스
2,Collage (EP),The Chainsmokers,2016.11.05,소니뮤직,일렉트로니카
3,If You,에일리,2016.08.23,로엔 엔터테인먼트,발라드
4,세 단어,젝스키스,2016.10.07,YG PLUS,발라드

In [57]:
jdf2_cut2 = jdf2_copy.loc[:,'Music Count':'Rating']

In [58]:
jdf2_cut2.head()

   Music Count  Rating
0            2     8.6
1           12     8.1
2            5     7.5
3            1     6.9
4            1     9.0

In [59]:
jdf2_cut = pd.concat([jdf2_cut1,jdf2_cut2], axis = 1)

In [60]:
jdf2_cut.head()

,Album Title,Artist Name,Date,Distribution,Genre,Music Count,Rating
0,Boys and Girls Music Vol. 1,샘김,2017.01.25,로엔 엔터테인먼트,알앤비/어반,2,8.6
1,여자친구 The 1st Album 'LOL',여자친구(GFRIEND),2016.07.11,로엔엔터테인먼트,댄스,12,8.1
2,Collage (EP),The Chainsmokers,2016.11.05,소니뮤직,일렉트로니카,5,7.5
3,If You,에일리,2016.08.23,로엔 엔터테인먼트,발라드,1,6.9
4,세 단어,젝스키스,2016.10.07,YG PLUS,발라드,1,9.0

In [61]:
jdf_copy = jdf.sort_index(axis = 1)

In [62]:
jdf_copy.head()

,Album Title,Artist Name,Date,Distribution,Genre,Music Count,Rating
0,거기가 어딘데?? OST,Various Artists,2018.09.01,워너뮤직코리아,O.S.T,8,6.4
1,얍,갈릭스(Garlixx),2018.09.01,(주)미러볼뮤직,"인디뮤직, 락",2,3.8
2,너와 나,파란,2018.09.01,(주)지니뮤직,발라드,2,7.7
3,PRODUCE 48 - FINAL,PRODUCE 48,2018.09.01,Stone Music Entertainment,댄스,4,7.0
4,Weather : 오늘 당신의 날씨는 어떤가요? Part 4,이진아,2018.09.01,(주)지니뮤직,재즈,1,6.7

In [63]:
jdf3 = pd.concat([jdf,jdf2_cut],axis = 0, ignore_index = True)

In [64]:
jdf3.head()

,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count
0,거기가 어딘데?? OST,Various Artists,O.S.T,2018.09.01,워너뮤직코리아,6.4,8
1,얍,갈릭스(Garlixx),"인디뮤직, 락",2018.09.01,(주)미러볼뮤직,3.8,2
2,너와 나,파란,발라드,2018.09.01,(주)지니뮤직,7.7,2
3,PRODUCE 48 - FINAL,PRODUCE 48,댄스,2018.09.01,Stone Music Entertainment,7.0,4
4,Weather : 오늘 당신의 날씨는 어떤가요? Part 4,이진아,재즈,2018.09.01,(주)지니뮤직,6.7,1

---

In [65]:
jdf3.head()

,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count
0,거기가 어딘데?? OST,Various Artists,O.S.T,2018.09.01,워너뮤직코리아,6.4,8
1,얍,갈릭스(Garlixx),"인디뮤직, 락",2018.09.01,(주)미러볼뮤직,3.8,2
2,너와 나,파란,발라드,2018.09.01,(주)지니뮤직,7.7,2
3,PRODUCE 48 - FINAL,PRODUCE 48,댄스,2018.09.01,Stone Music Entertainment,7.0,4
4,Weather : 오늘 당신의 날씨는 어떤가요? Part 4,이진아,재즈,2018.09.01,(주)지니뮤직,6.7,1

## 문제7: 위 데이터 프레임에 순위 열을 추가하고 Genre 그룹별로
## Rating이 높은 데이터부터 순위를 선정하여 표시해보자

In [66]:
jdf3['순위'] = jdf3.groupby('Genre')['Rating'].rank(ascending = False, method = 'min')

In [67]:
jdf3.head()

,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count,순위
0,거기가 어딘데?? OST,Various Artists,O.S.T,2018.09.01,워너뮤직코리아,6.4,8,3.0
1,얍,갈릭스(Garlixx),"인디뮤직, 락",2018.09.01,(주)미러볼뮤직,3.8,2,44.0
2,너와 나,파란,발라드,2018.09.01,(주)지니뮤직,7.7,2,367.0
3,PRODUCE 48 - FINAL,PRODUCE 48,댄스,2018.09.01,Stone Music Entertainment,7.0,4,497.0
4,Weather : 오늘 당신의 날씨는 어떤가요? Part 4,이진아,재즈,2018.09.01,(주)지니뮤직,6.7,1,3.0

In [68]:
jdf4 = jdf3.sort_values(by = '순위')

In [69]:
jdf4.head()

,Album Title,Artist Name,Genre,Date,Distribution,Rating,Music Count,순위
1289,4집 Viva La Vida Or Death And All His Friends,Coldplay,얼터너티브 락,2008.06.16,워너뮤직코리아,9.2,10,1.0
2828,‘The Story of Light’ EP.3 - The 6th Album,SHINee (샤이니),"알앤비/어반, 발라드, 댄스",2018.06.25,(주)아이리버,8.7,5,1.0
2829,‘The Story of Light’ EP.2 - The 6th Album,SHINee (샤이니),"일렉트로니카, 댄스, 알앤비/어반",2018.06.11,(주)아이리버,8.8,5,1.0
2830,‘The Story of Light’ EP.1 - The 6th Album,SHINee (샤이니),"댄스, 알앤비/어반, 일렉트로니카",2018.05.28,(주)아이리버,8.9,5,1.0
2182,Red Pill Blues (Deluxe Edition),Maroon 5,"팝, 얼터너티브 락",2017.11.03,유니버설뮤직,6.9,21,1.0

---